package com.malenikajkat.signal;

public class ButtonPresser{
    // Метод для нажатия кнопки влево
    public void pressLeftButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки влево
        System.out.println("Кнопка влево нажата");
    }

    // Метод для нажатия кнопки вправо
    public void pressRightButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки вправо
        System.out.println("Кнопка вправо нажата");
    }

    // Метод для нажатия кнопки стоп
    public void pressStopButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки стоп
        System.out.println("Кнопка стоп нажата");
    }

    // Метод для нажатия кнопки вверх
    public void pressUpButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки вверх
        System.out.println("Кнопка вверх нажата");
    }

    // Метод для нажатия кнопки вниз
    public void pressDownButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки вниз
        System.out.println("Кнопка вниз нажата");
    }

    // Метод для нажатия кнопки вперед
    public void pressForwardButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки вперед
        System.out.println("Кнопка вперед нажата");
    }

    // Метод для нажатия кнопки назад
    public void pressBackButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки назад
        System.out.println("Кнопка назад нажата");
    }

    // Метод для нажатия кнопки "запуск"
    public void pressStartButton() {
        // Здесь должен быть код, который выполняется при нажатии кнопки "запуск"
        System.out.println("Кнопка 'запуск' нажата");
    }
}
